# Notes - 04. Time Series

date - only month, day year
time - only hour, minute, second, part of second
datetime - date and time together

pandas - precision of a nano second unity

#### datetime module in Python
import datetime 

datetime data

timedelta = amount of time

In [2]:
import pandas as pd

In [4]:
pd.to_datetime('2018/12/22') #convert a string to a datetime -> Timestamp is a datetime in Pandas

Timestamp('2018-12-22 00:00:00')

In [7]:
pd.to_datetime('Jan 3rd, 2013 5:43') #international standart for time

Timestamp('2013-01-03 05:43:00')

In [11]:
pd.to_datetime(1000) #if you use a integer is gonna past the epoc, u can use unit='d' - 1000 days after the epox

Timestamp('1970-01-01 00:00:00.000001')

In [14]:
bikes = pd.read_csv('../data/bikes.csv')
bikes.head()

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
0,7147,Subscriber,Male,2013-06-28 19:01:00,2013-06-28 19:17:00,993,Lake Shore Dr & Monroe St,41.881050,-87.616970,11.0,Michigan Ave & Oak St,41.900960,-87.623777,15.0,73.9,10.0,12.7,-9999.0,mostlycloudy
1,7524,Subscriber,Male,2013-06-28 22:53:00,2013-06-28 23:03:00,623,Clinton St & Washington Blvd,41.883380,-87.641170,31.0,Wells St & Walton St,41.899930,-87.634430,19.0,69.1,10.0,6.9,-9999.0,partlycloudy
2,10927,Subscriber,Male,2013-06-30 14:43:00,2013-06-30 15:01:00,1040,Sheffield Ave & Kingsbury St,41.909592,-87.653497,15.0,Dearborn St & Monroe St,41.881320,-87.629521,23.0,73.0,10.0,16.1,-9999.0,mostlycloudy
3,12907,Subscriber,Male,2013-07-01 10:05:00,2013-07-01 10:16:00,667,Carpenter St & Huron St,41.894556,-87.653449,19.0,Clark St & Randolph St,41.884576,-87.631890,31.0,72.0,10.0,16.1,-9999.0,mostlycloudy
4,13168,Subscriber,Male,2013-07-01 11:16:00,2013-07-01 11:18:00,130,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,73.0,10.0,17.3,-9999.0,partlycloudy

In [33]:
bikes['starttime'] = pd.to_datetime(bikes['starttime']) #or you can use parse_dates=['starttime', 'stoptime']
bikes.head()
bikes['stoptime'] = pd.to_datetime(bikes['stoptime']) #or you can use parse_dates=['starttime', 'stoptime']
bikes.head()

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
0,7147,Subscriber,Male,2013-06-28 19:01:00,2013-06-28 19:17:00,993,Lake Shore Dr & Monroe St,41.881050,-87.616970,11.0,Michigan Ave & Oak St,41.900960,-87.623777,15.0,73.9,10.0,12.7,-9999.0,mostlycloudy
1,7524,Subscriber,Male,2013-06-28 22:53:00,2013-06-28 23:03:00,623,Clinton St & Washington Blvd,41.883380,-87.641170,31.0,Wells St & Walton St,41.899930,-87.634430,19.0,69.1,10.0,6.9,-9999.0,partlycloudy
2,10927,Subscriber,Male,2013-06-30 14:43:00,2013-06-30 15:01:00,1040,Sheffield Ave & Kingsbury St,41.909592,-87.653497,15.0,Dearborn St & Monroe St,41.881320,-87.629521,23.0,73.0,10.0,16.1,-9999.0,mostlycloudy
3,12907,Subscriber,Male,2013-07-01 10:05:00,2013-07-01 10:16:00,667,Carpenter St & Huron St,41.894556,-87.653449,19.0,Clark St & Randolph St,41.884576,-87.631890,31.0,72.0,10.0,16.1,-9999.0,mostlycloudy
4,13168,Subscriber,Male,2013-07-01 11:16:00,2013-07-01 11:18:00,130,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,73.0,10.0,17.3,-9999.0,partlycloudy

In [21]:
bikes.dtypes

trip_id                       int64
usertype                     object
gender                       object
starttime            datetime64[ns]
stoptime                     object
tripduration                  int64
from_station_name            object
latitude_start              float64
longitude_start             float64
dpcapacity_start            float64
to_station_name              object
latitude_end                float64
longitude_end               float64
dpcapacity_end              float64
temperature                 float64
visibility                  float64
wind_speed                  float64
precipitation               float64
events                       object
dtype: object

In [24]:
bikes.loc[0, 'starttime'] #dexplo library

Timestamp('2013-06-28 19:01:00')

In [25]:
start = bikes['starttime']

In [29]:
start.dt.date.head() #get power of your datetime str get power of your string

0    2013-06-28
1    2013-06-28
2    2013-06-30
3    2013-07-01
4    2013-07-01
Name: starttime, dtype: object

#### Timedelta 
an amount of time
    if you subtract two date times you will have a timedelta

In [31]:
pd.to_timedelta('4 days 5 hours')

Timedelta('4 days 05:00:00')

In [37]:
bikes['tripduration_calc'] = bikes['stoptime'] - bikes['starttime']
tdc = bikes['tripduration_calc']
tdc.head()

0   00:16:00
1   00:10:00
2   00:18:00
3   00:11:00
4   00:02:00
Name: tripduration_calc, dtype: timedelta64[ns]

# 02. INTRO TO TIME SERIES

* using JSON to get data from the api https://iextrading.com/
* this is one api really simple

In [40]:
#IEX API
url = 'https://api.iextrading.com/1.0/stock/aapl/chart/5y'

In [44]:
stocks = pd.read_json(url)
stocks.head() #already convert the dates to datetime

,change,changeOverTime,changePercent,close,date,high,label,low,open,unadjustedVolume,volume,vwap
0,2.762500,0.000000,3.838,74.7447,2013-12-23,74.8273,"Dec 23, 13",73.7837,74.4707,17903833,125326831,74.4027
1,-0.317288,-0.004244,-0.424,74.4275,2013-12-24,74.9794,"Dec 24, 13",74.2124,74.7185,5984105,41888735,74.5717
2,-0.494284,-0.010857,-0.664,73.9332,2013-12-26,74.6674,"Dec 26, 13",73.8645,74.4838,7286005,51002035,74.1287
3,-0.499533,-0.017541,-0.676,73.4336,2013-12-27,74.0000,"Dec 27, 13",73.3563,73.9227,8067331,56471317,73.5374
4,-0.730286,-0.027310,-0.994,72.7034,2013-12-30,73.4336,"Dec 30, 13",72.4150,73.0888,9058246,63407722,72.7190

In [45]:
#if u have datetime u can use this on the index - will give u a nice advantage in some cases

In [46]:
stocks = stocks.set_index('date')

In [48]:
stocks.head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2013-12-23,2.762500,0.000000,3.838,74.7447,74.8273,"Dec 23, 13",73.7837,74.4707,17903833,125326831,74.4027
2013-12-24,-0.317288,-0.004244,-0.424,74.4275,74.9794,"Dec 24, 13",74.2124,74.7185,5984105,41888735,74.5717
2013-12-26,-0.494284,-0.010857,-0.664,73.9332,74.6674,"Dec 26, 13",73.8645,74.4838,7286005,51002035,74.1287
2013-12-27,-0.499533,-0.017541,-0.676,73.4336,74.0000,"Dec 27, 13",73.3563,73.9227,8067331,56471317,73.5374
2013-12-30,-0.730286,-0.027310,-0.994,72.7034,73.4336,"Dec 30, 13",72.4150,73.0888,9058246,63407722,72.7190

In [52]:
#subselection with date time on the index
stocks.loc['2014-12-24'].head()

change           -0.494289
changeOverTime    0.397596
changePercent       -0.471
close              104.463
high               105.116
Name: 2014-12-24 00:00:00, dtype: object

In [55]:
stocks.loc['2014-12-22':'2015-12-22'].head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2014-12-22,1.081800,0.409200,1.038,105.3302,105.8432,"Dec 22, 14",104.4256,104.6028,45167549,45167549,105.2148
2014-12-23,-0.373049,0.404209,-0.354,104.9572,105.6940,"Dec 23, 14",104.8826,105.6007,26028419,26028419,105.1756
2014-12-24,-0.494289,0.397596,-0.471,104.4629,105.1157,"Dec 24, 14",104.4629,104.9945,14479611,14479611,104.6175
2014-12-26,1.846600,0.422302,1.768,106.3095,106.8038,"Dec 26, 14",104.4629,104.5468,33720951,33720951,105.9206
2014-12-29,-0.074610,0.421303,-0.070,106.2349,107.0369,"Dec 29, 14",106.0390,106.1230,27598920,27598920,106.5392

In [58]:
#PARTIAL STRING MATCHING - get the whole month, if is just the year would be all the transactions on that year
stocks.loc['2014-01'].head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2014-01-02,-1.034500,-0.029749,-1.406,72.5211,73.0324,"Jan 2, 14",72.3757,72.8554,8398851,58791957,72.1961
2014-01-03,-1.593000,-0.051062,-2.197,70.9281,72.5958,"Jan 3, 14",70.8560,72.4857,14043410,98303870,71.5008
2014-01-06,0.386777,-0.045887,0.545,71.3149,71.6912,"Jan 6, 14",69.9605,70.4653,14765593,103359151,70.9303
2014-01-07,-0.510346,-0.052714,-0.716,70.8046,71.5811,"Jan 7, 14",70.5276,71.3660,11347538,79432766,71.7785
2014-01-08,0.448723,-0.046711,0.634,71.2533,71.5286,"Jan 8, 14",70.6279,70.6436,9240955,64686685,71.2531

In [63]:
stocks.loc['2014-6-1':'2014-8'].head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2014-06-02,-0.574197,0.110202,-0.687,82.9817,83.7975,"Jun 2, 14",82.1699,83.6826,13191129,92337903,83.0617
2014-06-09,1.363600,0.158327,1.600,86.5788,86.7451,"Jun 9, 14",84.7769,85.6548,75414804,75414804,86.0268
2014-06-16,0.850081,0.139784,1.008,85.1928,85.7010,"Jun 16, 14",84.4998,84.5552,35561270,35561270,85.1030
2014-06-23,-0.073920,0.122848,-0.088,83.9269,84.6568,"Jun 23, 14",83.7144,84.3796,43694391,43694391,84.0226
2014-06-30,0.877800,0.148808,1.033,85.8673,86.6018,"Jun 30, 14",85.0911,85.1004,49589028,49589028,85.9819

In [64]:
from Ipython.display import Iframe
#

ModuleNotFoundError: No module named 'Ipython'

In [69]:
#just work with datetime index
stocks.asfreq('M').head() #every last day of each month - LOOK INTO THE ALIASES

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2013-12-31,0.852221,-0.015909,1.172,73.5556,73.5897,"Dec 31, 13",72.6352,72.6575,7974196.0,55819372.0,73.3833
2014-01-31,0.107251,-0.121892,0.164,65.6339,65.7558,"Jan 31, 14",64.7096,64.9233,16619492.0,116336444.0,71.6528
2014-02-28,-0.188612,-0.071392,-0.271,69.4085,70.2672,"Feb 28, 14",68.8651,69.7831,13296379.0,93074653.0,69.5702
2014-03-31,-0.015825,-0.052864,-0.022,70.7934,71.3303,"Mar 31, 14",70.6866,71.1219,6023884.0,42167188.0,70.9193
2014-04-30,-0.295446,0.041278,-0.378,77.8300,79.0619,"Apr 30, 14",77.7918,78.1664,16317269.0,114220883.0,78.3607

In [70]:
stocks.asfreq('2M').head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2013-12-31,0.852221,-0.015909,1.172,73.5556,73.5897,"Dec 31, 13",72.6352,72.6575,7974196.0,55819372.0,73.3833
2014-02-28,-0.188612,-0.071392,-0.271,69.4085,70.2672,"Feb 28, 14",68.8651,69.7831,13296379.0,93074653.0,69.5702
2014-04-30,-0.295446,0.041278,-0.378,77.8300,79.0619,"Apr 30, 14",77.7918,78.1664,16317269.0,114220883.0,78.3607
2014-06-30,0.877800,0.148808,1.033,85.8673,86.6018,"Jun 30, 14",85.0911,85.1004,49589028.0,49589028.0,85.9819
2014-08-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [73]:
stocks.asfreq('W-MON').head() #OFFSET ALIASES

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2013-12-23,2.762500,0.000000,3.838,74.7447,74.8273,"Dec 23, 13",73.7837,74.4707,17903833.0,125326831.0,74.4027
2013-12-30,-0.730286,-0.027310,-0.994,72.7034,73.4336,"Dec 30, 13",72.4150,73.0888,9058246.0,63407722.0,72.7190
2014-01-06,0.386777,-0.045887,0.545,71.3149,71.6912,"Jan 6, 14",69.9605,70.4653,14765593.0,103359151.0,70.9303
2014-01-13,0.365800,-0.060270,0.524,70.2398,71.1274,"Jan 13, 14",69.4728,69.4767,13551549.0,94860843.0,69.9468
2014-01-20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [76]:
#USE ASFREQ using a frequency smaller than you have, its gonna add rows with NaN to follow your requirements
stocks.asfreq('D').head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2013-12-23,2.762500,0.000000,3.838,74.7447,74.8273,"Dec 23, 13",73.7837,74.4707,17903833.0,125326831.0,74.4027
2013-12-24,-0.317288,-0.004244,-0.424,74.4275,74.9794,"Dec 24, 13",74.2124,74.7185,5984105.0,41888735.0,74.5717
2013-12-25,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-12-26,-0.494284,-0.010857,-0.664,73.9332,74.6674,"Dec 26, 13",73.8645,74.4838,7286005.0,51002035.0,74.1287
2013-12-27,-0.499533,-0.017541,-0.676,73.4336,74.0000,"Dec 27, 13",73.3563,73.9227,8067331.0,56471317.0,73.5374

# 03. GROUPING BY TIME

Whatever amount of time you want to group
resample

In [79]:
stocks.head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2013-12-23,2.762500,0.000000,3.838,74.7447,74.8273,"Dec 23, 13",73.7837,74.4707,17903833,125326831,74.4027
2013-12-24,-0.317288,-0.004244,-0.424,74.4275,74.9794,"Dec 24, 13",74.2124,74.7185,5984105,41888735,74.5717
2013-12-26,-0.494284,-0.010857,-0.664,73.9332,74.6674,"Dec 26, 13",73.8645,74.4838,7286005,51002035,74.1287
2013-12-27,-0.499533,-0.017541,-0.676,73.4336,74.0000,"Dec 27, 13",73.3563,73.9227,8067331,56471317,73.5374
2013-12-30,-0.730286,-0.027310,-0.994,72.7034,73.4336,"Dec 30, 13",72.4150,73.0888,9058246,63407722,72.7190

In [83]:
# grouping by Month, getting the max of the close value
stocks.resample('M').agg({'close':'max'}).head()

              close
date
2013-12-31  74.7447
2014-01-31  73.0757
2014-02-28  72.0135
2014-03-31  71.8816
2014-04-30  78.3576

In [84]:
stocks.resample('Q', kind='period').agg({'close':'max'}).head()
# a period object in pandas mean a whole period of time

           close
date
2013Q4   74.7447
2014Q1   73.0757
2014Q2   87.0870
2014Q3   95.9239
2014Q4  110.9819

In [85]:
stocks.resample('W', kind='period').agg({'close':'max'}).head()

                         close
date
2013-12-23/2013-12-29  74.7447
2013-12-30/2014-01-05  73.5556
2014-01-06/2014-01-12  71.3149
2014-01-13/2014-01-19  73.0757
2014-01-20/2014-01-26  72.9210

# 4. Rolling WIndows

* go to the row and look to the above

In [92]:
import pandas as pd
import numpy as np
s = pd.Series([4,1,12,8,10,18,2,12])
s

0     4
1     1
2    12
3     8
4    10
5    18
6     2
7    12
dtype: int64

In [88]:
s.rolling(3).mean()

0          NaN
1          NaN
2     5.666667
3     7.000000
4    10.000000
5    12.000000
6    10.000000
7    10.666667
dtype: float64

In [90]:
s.rolling(3, min_periods=1).mean()

0     4.000000
1     2.500000
2     5.666667
3     7.000000
4    10.000000
5    12.000000
6    10.000000
7    10.666667
dtype: float64

In [93]:
s.rolling(3, min_periods=1).agg(['min','max','mean', np.size])

   min   max       mean  size
0  4.0   4.0   4.000000   1.0
1  1.0   4.0   2.500000   2.0
2  1.0  12.0   5.666667   3.0
3  1.0  12.0   7.000000   3.0
4  8.0  12.0  10.000000   3.0
5  8.0  18.0  12.000000   3.0
6  2.0  18.0  10.000000   3.0
7  2.0  18.0  10.666667   3.0

In [98]:
# you can use rolling with offset alias 
#datetime need to be in the index
# the size is about the days now, so a size 5 would be a Friday and a size 1 would be a Monday
stocks.rolling('5D').agg({'close':['min','max', 'mean', np.size]})

               close
                 min       max        mean size
date
2013-12-23   74.7447   74.7447   74.744700  1.0
2013-12-24   74.4275   74.7447   74.586100  2.0
2013-12-26   73.9332   74.7447   74.368467  3.0
2013-12-27   73.4336   74.7447   74.134750  4.0
2013-12-30   72.7034   73.9332   73.356733  3.0
2013-12-31   72.7034   73.5556   73.230867  3.0
2014-01-02   72.5211   73.5556   72.926700  3.0
2014-01-03   70.9281   73.5556   72.427050  4.0
2014-01-06   70.9281   72.5211   71.588033  3.0
2014-01-07   70.8046   71.3149   71.015867  3.0
2014-01-08   70.8046   71.3149   71.124267  3.0
2014-01-09   70.3432   71.3149   70.929000  4.0
2014-01-10   69.8740   71.3149   70.718000  5.0
2014-01-13   69.8740   70.3432   70.152333  3.0
2014-01-14   69.8740   71.6374   70.583733  3.0
2014-01-15   70.2398   73.0757   71.650967  3.0
2014-01-16   70.2398   73.0757   71.905225  4.0
2014-01-17   70.2398   73.0757   71.701680  5.0
2014-01-21   70.8875   71.9888   71.438150  2.0
2014-01-22   71.9888   72.3087   72.148750  2.0
2014-01-23   71.9888   72.9210   72.406167  3.0
2014-01-24   71.5955   72.9210   72.203500  4.0
2014-01-27   71.5955   72.9210   72.230933  3.0
2014-01-28   66.4074   72.1763   70.059733  3.0
2014-01-29   65.6535   72.1763   68.079067  3.0
2014-01-30   65.5266   72.1763   67.440950  4.0
2014-01-31   65.5266   72.1763   67.079540  5.0
2014-02-03   65.5266   65.7558   65.638767  3.0
2014-02-04   65.6339   66.7077   66.032467  3.0
2014-02-05   65.7558   67.2059   66.556467  3.0
...              ...       ...         ...  ...
2018-11-08  200.8891  209.2200  205.415150  4.0
2018-11-09  200.8891  209.2200  205.226120  5.0
2018-11-12  194.1700  208.4900  202.376667  3.0
2018-11-13  192.2300  204.4700  196.956667  3.0
2018-11-14  186.8000  194.1700  191.066667  3.0
2018-11-15  186.8000  194.1700  191.152500  4.0
2018-11-16  186.8000  194.1700  191.628000  5.0
2018-11-19  185.8600  193.5300  190.266667  3.0
2018-11-20  176.9800  193.5300  185.456667  3.0
2018-11-21  176.7800  185.8600  179.873333  3.0
2018-11-23  172.2900  185.8600  177.977500  4.0
2018-11-26  172.2900  174.6200  173.455000  2.0
2018-11-27  172.2900  174.6200  173.716667  3.0
2018-11-28  174.2400  180.9400  176.600000  3.0
2018-11-29  174.2400  180.9400  177.337500  4.0
2018-11-30  174.2400  180.9400  177.586000  5.0
2018-12-03  178.5800  184.8200  180.983333  3.0
2018-12-04  176.6900  184.8200  180.030000  3.0
2018-12-06  174.7200  184.8200  178.743333  3.0
2018-12-07  168.4900  184.8200  176.180000  4.0
2018-12-10  168.4900  174.7200  170.936667  3.0
2018-12-11  168.4900  169.6000  168.906667  3.0
2018-12-12  168.6300  169.6000  169.110000  3.0
2018-12-13  168.6300  170.9500  169.570000  4.0
2018-12-14  165.4800  170.9500  168.752000  5.0
2018-12-17  163.9400  170.9500  166.790000  3.0
2018-12-18  163.9400  166.0700  165.163333  3.0
2018-12-19  160.8900  166.0700  163.633333  3.0
2018-12-20  156.8300  166.0700  161.932500  4.0
2018-12-21  150.7300  166.0700  159.692000  5.0

[1259 rows x 4 columns]

# 05. Grouping by time and other column

In [104]:
emp = pd.read_csv('../data/employee.csv', parse_dates=['hire_date'], index_col='hire_date')

In [106]:
emp.head()

,title,dept,salary,race,gender
hire_date,,,,,
2015-02-03,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Male
1982-02-08,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Male
1984-11-26,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black,Male
2012-03-26,ENGINEER,Public Works & Engineering-PWE,71680.0,Asian,Male
2013-11-04,CARPENTER,Houston Airport System (HAS),42390.0,White,Male

In [108]:
emp.resample('5Y').agg({'salary':['mean', 'size']}).round(-3).head()

             salary
               mean size
hire_date
1958-12-31  81000.0    0
1963-12-31      NaN    0
1968-12-31  90000.0    0
1973-12-31  67000.0    0
1978-12-31  89000.0    0

In [110]:
#almost the same than before but now adding 
#one more column on the grouping
tg = pd.Grouper(freq='5Y')
emp.groupby(tg).agg({'salary':['mean','size']}).round(-3).head()

             salary
               mean size
hire_date
1958-12-31  81000.0    0
1963-12-31      NaN    0
1968-12-31  90000.0    0
1973-12-31  67000.0    0
1978-12-31  89000.0    0

In [111]:
#grouping together
tg=pd.Grouper(freq='5Y')
groups = ['gender', tg]

In [112]:
emp.groupby(groups).agg({'salary':['mean','size']}).round(0)

                    salary
                      mean size
gender hire_date
Female 1978-12-31      NaN    1
       1983-12-31  55307.0   13
       1988-12-31  58678.0   18
       1993-12-31  55667.0   60
       1998-12-31  59872.0   46
       2003-12-31  51187.0   51
       2008-12-31  49322.0   93
       2013-12-31  52158.0   69
       2018-12-31  38727.0   74
Male   1958-12-31  81239.0    1
       1968-12-31  89590.0    1
       1973-12-31  66614.0    2
       1978-12-31  88503.0   23
       1983-12-31  71987.0   83
       1988-12-31  70412.0   84
       1993-12-31  66628.0  144
       1998-12-31  64579.0  134
       2003-12-31  62724.0  160
       2008-12-31  56424.0  230
       2013-12-31  50899.0  182
       2018-12-31  40460.0  184

In [119]:
#still grouping together
#to report or to display you should use pivot_table
#if u are still going with ur analysis use groupby
tg = pd.Grouper(freq='5Y')
emp.pivot_table(index=tg, columns='gender', values='salary', aggfunc='mean').round(-3)

gender       Female     Male
hire_date
1958-12-31      NaN  81000.0
1968-12-31      NaN  90000.0
1973-12-31      NaN  67000.0
1978-12-31      NaN  89000.0
1983-12-31  55000.0  72000.0
1988-12-31  59000.0  70000.0
1993-12-31  56000.0  67000.0
1998-12-31  60000.0  65000.0
2003-12-31  51000.0  63000.0
2008-12-31  49000.0  56000.0
2013-12-31  52000.0  51000.0
2018-12-31  39000.0  40000.0

In [118]:
#group independently 
#just work with one method: mean
emp.groupby('gender').resample('5Y').agg({'salary':'mean'}).round(0)

                    salary
gender hire_date
Female 1975-12-31      NaN
       1980-12-31  55594.0
       1985-12-31  56340.0
       1990-12-31  56078.0
       1995-12-31  58287.0
       2000-12-31  52785.0
       2005-12-31  54178.0
       2010-12-31  49599.0
       2015-12-31  44601.0
       2020-12-31  35815.0
Male   1958-12-31  81239.0
       1963-12-31      NaN
       1968-12-31  89590.0
       1973-12-31  66614.0
       1978-12-31  88503.0
       1983-12-31  71987.0
       1988-12-31  70412.0
       1993-12-31  66628.0
       1998-12-31  64579.0
       2003-12-31  62724.0
       2008-12-31  56424.0
       2013-12-31  50899.0
       2018-12-31  40460.0

In [115]:
df

NameError: name 'df' is not defined